app/views/pages/home.html.erb

                <div class="col-sm-11">
                    <p class="post-title"><spam class="post-owner"><%=User.find(@p.user_id).username %></spam><spam class="post-creation"> - <%=@p.created_at.to_formatted_s(:short) %></spam></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]