app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello World"], ["user_id", 2], ["created_at", "2017-04-06 10:59:08.712612"], ["updated_at", "2017-04-06 10:59:08.712612"]]
---
   def create
       @post = Post.new(post_params)
       @post.user_id = current_user.id
       respond_to do |f|
           if (@post.save)